SM_для_EDT/src/Enums/vftСтатусыДокументовСообщений/vftСтатусыДокументовСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументовСообщений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Инициировано</name>
  </enumValues>
  <enumValues>
    <name>Проведено</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаСудно</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Доработан</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/vftСтатусыДокументовСообщений/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда
		
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт"));
		
		Если Параметры.Свойство("Ссылка") Тогда	
			
			Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.рарусУчение") Тогда
				
				ДанныеВыбора.Очистить();
				//rarus_AfoD 10.09.2021 < 
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
				//rarus_AfoD 10.09.2021 > 
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Проведено"));
				
			КонецЕсли;
			
			Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.рарусМероприятиеСУБ") Тогда
				
				ДанныеВыбора.Очистить();
				
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Проведено"));
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
			
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт"));
		
	КонецЕсли;
	
КонецПроцедуры
